//+------------------------------------------------------------------+
//|                                                       DelAll.mq4 |
//|                                                    Force_Majeure |
//|                                                  force_m@mail.ru |
//+------------------------------------------------------------------+
#property copyright "Force_Majeure"
#property link      "force_m@mail.ru"
//+------------------------------------------------------------------+
//| script program start function                                    |
//+------------------------------------------------------------------+
int start() {
   // Скрипт удаляет все созданные объекты
ObjectsDeleteAll();
return(0);
}
//+------------------------------------------------------------------+