//+------------------------------------------------------------------+
//|                                                       Common.mqh |
//|                                                    Force_Majeure |
//|                                                  force_m@mail.ru |
//+------------------------------------------------------------------+
#property copyright "Force_Majeure"
#property link      "force_m@mail.ru"
//+------------------------------------------------------------------+
//| defines                                                          |
//+------------------------------------------------------------------+
#define MOVING_NULL  0  // Движение тренда не определено
#define MOVING_UP    1  // Движение тренда вверх
#define MOVING_NON   2  // Движение тренда ровное
#define MOVING_DOWN  3  // Движение тренда вниз

#define MOVING_NOT_CHANGED       0  // Движение не изменилось
#define MOVING_CHANGED_TO_UP     1  // Движение изменилось и пошло вверх
#define MOVING_CHANGED_TO_NON    2  // Движение изменилось и стало ровным
#define MOVING_CHANGED_TO_DOWN   3  // Движение изменилось и пошло вниз
//+------------------------------------------------------------------+
double PI = 3.1415926535;
//+------------------------------------------------------------------+
//| Functions                                                        |
//+------------------------------------------------------------------+

